HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Documents/ДБ_АктыВыполненныхРабот/ДБ_АктыВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДБ_АктыВыполненныхРабот</name>
  <registerRecords>AccumulationRegister.ДБ_АктыВыполненияРабот</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.ДБ_Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлы</name>
    <attributes>
      <name>ДанныеФайла</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/AccumulationRegisters/ДБ_АктыВыполненияРабот/ДБ_АктыВыполненияРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДБ_АктыВыполненияРабот</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ДБ_Задачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Documents/ДБ_АктыВыполненныхРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Задача,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Задача.Аналитика КАК Аналитика,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Сумма,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Ссылка.Дата КАК Период,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Ссылка.Заказчик,
		|	&ВидДвижения
		|ИЗ
		|	Документ.ДБ_АктыВыполненныхРабот.ВыполненныеЗадачи КАК ДБ_АктыВыполненныхРаботыВыполненныеЗадачи
		|ГДЕ
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ДБ_АктыВыполненияРабот.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Движения.ДБ_АктыВыполненияРабот.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


#КонецЕсли
